tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/test-bot"

# Search tool like grep, but optimized for programmers
brew "ack"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# package manager for node
brew "nvm"
# Mac App Store command-line interface
brew "mas"
# package manager for ruby
brew "rbenv"
# terminal panel manager
brew "tmux"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Google Chrome Browser
cask "google-chrome"
# Better terminal
cask 'iterm2'
# Communication Tool For Team
cask "slack"
# Streaming Music
cask 'spotify'
# Open-source code editor
cask "visual-studio-code"
