cask_args appdir: '/Applications'

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"

brew 'coreutils'
brew 'composer'
brew "git"
brew "mas"
brew "tmux"
brew "php"
brew "python"

cask 'mysqlworkbench'
cask 'dropbox'
cask "google-chrome"
cask 'iterm2'
cask 'postman'
cask "slack"
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
